{
  "version": "1.0",
  "truncation": {
    "direction": "Right",
    "max_length": 128,
    "strategy": "LongestFirst",
    "stride": 0
  },
  "padding": {
    "strategy": {
      "Fixed": 128
    },
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 0,
    "pad_type_id": 0,
    "pad_token": "[PAD]"
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 101,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 102,
      "content": "[CLS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 103,
      "content": "[SEP]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 104,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "BertNormalizer",
    "clean_text": true,
    "handle_chinese_chars": true,
    "strip_accents": null,
    "lowercase": true
  },
  "pre_tokenizer": {
    "type": "BertPreTokenizer"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "SpecialToken": {
          "id": "[CLS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      },
      {
        "SpecialToken": {
          "id": "[SEP]",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "[CLS]": {
        "id": "[CLS]",
        "ids": [
          102
        ],
        "tokens": [
          "[CLS]"
        ]
      },
      "[SEP]": {
        "id": "[SEP]",
        "ids": [
          103
        ],
        "tokens": [
          "[SEP]"
        ]
      }
    }
  },
  "decoder": {
    "type": "WordPiece",
    "prefix": "##",
    "cleanup": true
  },
  "model": {
    "type": "WordPiece",
    "unk_token": "[UNK]",
    "continuing_subword_prefix": "##",
    "max_input_chars_per_word": 100,
    "vocab": {
      "[PAD]": 0,
      "[unused0]": 1,
      "[unused1]": 2,
      "[unused2]": 3,
      "[unused3]": 4,
      "[unused4]": 5,
      "[unused5]": 6,
      "[unused6]": 7,
      "[unused7]": 8,
      "[unused8]": 9,
      "[unused9]": 10,
      "[unused10]": 11,
      "[unused11]": 12,
      "[unused12]": 13,
      "[unused13]": 14,
      "[unused14]": 15,
      "[unused15]": 16,
      "[unused16]": 17,
      "[unused17]": 18,
      "[unused18]": 19,
      "[unused19]": 20,
      "[unused20]": 21,
      "[unused21]": 22,
      "[unused22]": 23,
      "[unused23]": 24,
      "[unused24]": 25,
      "[unused25]": 26,
      "[unused26]": 27,
      "[unused27]": 28,
      "[unused28]": 29,
      "[unused29]": 30,
      "[unused30]": 31,
      "[unused31]": 32,
      "[unused32]": 33,
      "[unused33]": 34,
      "[unused34]": 35,
      "[unused35]": 36,
      "[unused36]": 37,
      "[unused37]": 38,
      "[unused38]": 39,
      "[unused39]": 40,
      "[unused40]": 41,
      "[unused41]": 42,
      "[unused42]": 43,
      "[unused43]": 44,
      "[unused44]": 45,
      "[unused45]": 46,
      "[unused46]": 47,
      "[unused47]": 48,
      "[unused48]": 49,
      "[unused49]": 50,
      "[unused50]": 51,
      "[unused51]": 52,
      "[unused52]": 53,
      "[unused53]": 54,
      "[unused54]": 55,
      "[unused55]": 56,
      "[unused56]": 57,
      "[unused57]": 58,
      "[unused58]": 59,
      "[unused59]": 60,
      "[unused60]": 61,
      "[unused61]": 62,
      "[unused62]": 63,
      "[unused63]": 64,
      "[unused64]": 65,
      "[unused65]": 66,
      "[unused66]": 67,
      "[unused67]": 68,
      "[unused68]": 69,
      "[unused69]": 70,
      "[unused70]": 71,
      "[unused71]": 72,
      "[unused72]": 73,
      "[unused73]": 74,
      "[unused74]": 75,
      "[unused75]": 76,
      "[unused76]": 77,
      "[unused77]": 78,
      "[unused78]": 79,
      "[unused79]": 80,
      "[unused80]": 81,
      "[unused81]": 82,
      "[unused82]": 83,
      "[unused83]": 84,
      "[unused84]": 85,
      "[unused85]": 86,
      "[unused86]": 87,
      "[unused87]": 88,
      "[unused88]": 89,
      "[unused89]": 90,
      "[unused90]": 91,
      "[unused91]": 92,
      "[unused92]": 93,
      "[unused93]": 94,
      "[unused94]": 95,
      "[unused95]": 96,
      "[unused96]": 97,
      "[unused97]": 98,
      "[unused98]": 99,
      "[unused99]": 100,
      "[UNK]": 101,
      "[CLS]": 102,
      "[SEP]": 103,
      "[MASK]": 104,
      "!": 105,
      "\"": 106,
      "#": 107,
      "$": 108,
      "%": 109,
      "&": 110,
      "'": 111,
      "(": 112,
      ")": 113,
      "*": 114,
      "+": 115,
      ",": 116,
      "-": 117,
      ".": 118,
      "/": 119,
      "0": 120,
      "1": 121,
      "2": 122,
      "3": 123,
      "4": 124,
      "5": 125,
      "6": 126,
      "7": 127,
      "8": 128,
      "9": 129,
      ":": 130,
      ";": 131,
      "<": 132,
      "=": 133,
      ">": 134,
      "?": 135,
      "@": 136,
      "[": 137,
      "\\": 138,
      "]": 139,
      "^": 140,
      "_": 141,
      "`": 142,
      "a": 143,
      "b": 144,
      "c": 145,
      "d": 146,
      "e": 147,
      "f": 148,
      "g": 149,
      "h": 150,
      "i": 151,
      "j": 152,
      "k": 153,
      "l": 154,
      "m": 155,
      "n": 156,
      "o": 157,
      "p": 158,
      "q": 159,
      "r": 160,
      "s": 161,
      "t": 162,
      "u": 163,
      "v": 164,
      "w": 165,
      "x": 166,
      "y": 167,
      "z": 168,
      "{": 169,
      "|": 170,
      "}": 171,
      "~": 172,
      "¡": 173,
      "¢": 174,
      "£": 175,
      "¤": 176,
      "¥": 177,
      "¦": 178,
      "§": 179,
      "¨": 180,
      "©": 181,
      "ª": 182,
      "«": 183,
      "¬": 184,
      "®": 185,
      "¯": 186,
      "°": 187,
      "±": 188,
      "²": 189,
      "³": 190,
      "´": 191,
      "µ": 192,
      "¶": 193,
      "·": 194,
      "¸": 195,
      "¹": 196,
      "º": 197,
      "»": 198,
      "¼": 199,
      "½": 200,
      "¾": 201,
      "¿": 202,
      "×": 203,
      "ß": 204,
      "æ": 205,
      "ð": 206,
      "÷": 207,
      "ø": 208,
      "þ": 209,
      "đ": 210,
      "ı": 211,
      "ĸ": 212,
      "ł": 213,
      "œ": 214,
      "ŧ": 215,
      "ƒ": 216,
      "ǀ": 217,
      "ǂ": 218,
      "ɑ": 219,
      "ɨ": 220,
      "ɷ": 221,
      "ʻ": 222,
      "ʼ": 223,
      "˂": 224,
      "ˆ": 225,
      "ˈ": 226,
      "ˉ": 227,
      "˙": 228,
      "˚": 229,
      "˜": 230,
      "ˡ": 231,
      "ˮ": 232,
      "΄": 233,
      "α": 234,
      "β": 235,
      "γ": 236,
      "δ": 237,
      "ε": 238,
      "ζ": 239,
      "η": 240,
      "ι": 241,
      "κ": 242,
      "λ": 243,
      "μ": 244,
      "ο": 245,
      "π": 246,
      "σ": 247,
      "υ": 248,
      "φ": 249,
      "χ": 250,
      "ω": 251,
      "ϒ": 252,
      "ϖ": 253,
      "а": 254,
      "б": 255,
      "в": 256,
      "д": 257,
      "з": 258,
      "и": 259,
      "к": 260,
      "м": 261,
      "н": 262,
      "о": 263,
      "п": 264,
      "р": 265,
      "с": 266,
      "т": 267,
      "у": 268,
      "ф": 269,
      "ц": 270,
      "ь": 271,
      "я": 272,
      "є": 273,
      "ѕ": 274,
      "і": 275,
      "ј": 276,
      "љ": 277,
      "ҫ": 278,
      "ا": 279,
      "ح": 280,
      "ـ": 281,
      "ل": 282,
      "ە": 283,
      "۷": 284,
      "฿": 285,
      "໿": 286,
      "ཉ": 287,
      "ཫ": 288,
      "ྊ": 289,
      "࿠": 290,
      "࿸": 291,
      "ᵃ": 292,
      "ᵞ": 293,
      "‖": 294,
      "‘": 295,
      "’": 296,
      "‚": 297,
      "‛": 298,
      "“": 299,
      "”": 300,
      "„": 301,
      "‟": 302,
      "†": 303,
      "‡": 304,
      "•": 305,
      "…": 306,
      "‧": 307,
      "‰": 308,
      "′": 309,
      "″": 310,
      "‹": 311,
      "›": 312,
      "⁄": 313,
      "⁰": 314,
      "⁴": 315,
      "⁵": 316,
      "⁶": 317,
      "⁷": 318,
      "⁹": 319,
      "⁺": 320,
      "⁻": 321,
      "⁽": 322,
      "⁾": 323,
      "₁": 324,
      "₂": 325,
      "₋": 326,
      "₤": 327,
      "₨": 328,
      "₩": 329,
      "€": 330,
      "₱": 331,
      "℃": 332,
      "℅": 333,
      "℉": 334,
      "№": 335,
      "℠": 336,
      "™": 337,
      "⅓": 338,
      "⅔": 339,
      "⅛": 340,
      "⅜": 341,
      "⅝": 342,
      "⅞": 343,
      "ⅰ": 344,
      "ⅱ": 345,
      "ⅲ": 346,
      "ⅳ": 347,
      "↑": 348,
      "→": 349,
      "↓": 350,
      "⇒": 351,
      "∆": 352,
      "∊": 353,
      "∎": 354,
      "∑": 355,
      "−": 356,
      "∕": 357,
      "∗": 358,
      "∙": 359,
      "√": 360,
      "∞": 361,
      "∠": 362,
      "∼": 363,
      "≈": 364,
      "≤": 365,
      "≥": 366,
      "⋅": 367,
      "⎼": 368,
      "①": 369,
      "②": 370,
      "③": 371,
      "④": 372,
      "⑤": 373,
      "⑥": 374,
      "─": 375,
      "│": 376,
      "┼": 377,
      "╱": 378,
      "■": 379,
      "□": 380,
      "▪": 381,
      "▫": 382,
      "▲": 383,
      "►": 384,
      "▼": 385,
      "◆": 386,
      "◊": 387,
      "○": 388,
      "●": 389,
      "◦": 390,
      "◾": 391,
      "★": 392,
      "☐": 393,
      "☑": 394,
      "☒": 395,
      "☨": 396,
      "☺": 397,
      "♠": 398,
      "♣": 399,
      "♥": 400,
      "♦": 401,
      "✓": 402,
      "✔": 403,
      "✗": 404,
      "✘": 405,
      "❖": 406,
      "❶": 407,
      "❷": 408,
      "❸": 409,
      "❹": 410,
      "❺": 411,
      "➢": 412,
      "➤": 413,
      "ⱡ": 414,
      "⸶": 415,
      "⸸": 416,
      "、": 417,
      "。": 418,
      "《": 419,
      "》": 420,
      "【": 421,
      "】": 422,
      "㎡": 423,
      "ﬀ": 424,
      "ﬁ": 425,
      "ﬂ": 426,
      "ﬃ": 427,
      "﴾": 428,
      "﴿": 429,
      "﷐": 430,
      "＄": 431,
      "％": 432,
      "＆": 433,
      "（": 434,
      "）": 435,
      "，": 436,
      "－": 437,
      "．": 438,
      "：": 439,
      "；": 440,
      "ｇ": 441,
      "ｏ": 442,
      "～": 443,
      "ﾀ": 444,
      "￡": 445,
      "￥": 446,
      "￦": 447,
      "🌑": 448,
      "##i": 449,
      "##l": 450,
      "##e": 451,
      "##y": 452,
      "##f": 453,
      "##c": 454,
      "##h": 455,
      "##o": 456,
      "##u": 457,
      "##n": 458,
      "##t": 459,
      "##g": 460,
      "##m": 461,
      "##a": 462,
      "##r": 463,
      "##k": 464,
      "##5": 465,
      "##2": 466,
      "##0": 467,
      "##p": 468,
      "##s": 469,
      "##x": 470,
      "##d": 471,
      "##8": 472,
      "##3": 473,
      "##±": 474,
      "##6": 475,
      "##1": 476,
      "##7": 477,
      "##b": 478,
      "##w": 479,
      "##q": 480,
      "##v": 481,
      "##4": 482,
      "##9": 483,
      "##z": 484,
      "##j": 485,
      "##×": 486,
      "##³": 487,
      "##¾": 488,
      "##´": 489,
      "##−": 490,
      "##µ": 491,
      "##≥": 492,
      "##€": 493,
      "##œ": 494,
      "##¹": 495,
      "##¤": 496,
      "##ł": 497,
      "##¨": 498,
      "##⁄": 499,
      "##º": 500,
      "##²": 501,
      "##¢": 502,
      "##μ": 503,
      "##¼": 504,
      "##м": 505,
      "##к": 506,
      "##∆": 507,
      "##ﬁ": 508,
      "##¸": 509,
      "##æ": 510,
      "##≤": 511,
      "##˚": 512,
      "##υ": 513,
      "##δ": 514,
      "##ø": 515,
      "##β": 516,
      "##½": 517,
      "##ß": 518,
      "##и": 519,
      "##√": 520,
      "##ʼ": 521,
      "##с": 522,
      "##н": 523,
      "##ε": 524,
      "##⅜": 525,
      "##∑": 526,
      "##⁻": 527,
      "##⁴": 528,
      "##α": 529,
      "##γ": 530,
      "##д": 531,
      "##ц": 532,
      "##ˆ": 533,
      "##ǂ": 534,
      "##ω": 535,
      "##¬": 536,
      "##¯": 537,
      "##¥": 538,
      "##∞": 539,
      "##þ": 540,
      "##£": 541,
      "##ζ": 542,
      "##ο": 543,
      "##љ": 544,
      "##⅝": 545,
      "##у": 546,
      "##ı": 547,
      "##κ": 548,
      "##ـ": 549,
      "##ﬂ": 550,
      "##∙": 551,
      "##⁰": 552,
      "##⁺": 553,
      "##∊": 554,
      "##₂": 555,
      "##΄": 556,
      "##ｇ": 557,
      "##ｏ": 558,
      "##⅓": 559,
      "##⅛": 560,
      "##ɑ": 561,
      "##ð": 562,
      "##～": 563,
      "##т": 564,
      "##ە": 565,
      "##໿": 566,
      "##⁹": 567,
      "##в": 568,
      "##ј": 569,
      "##б": 570,
      "##ﬀ": 571,
      "##і": 572,
      "##⅞": 573,
      "##ª": 574,
      "##ᵞ": 575,
      "##∕": 576,
      "##ҫ": 577,
      "##˂": 578,
      "##⅔": 579,
      "##ŧ": 580,
      "##φ": 581,
      "##а": 582,
      "##ل": 583,
      "##ا": 584,
      "##ˉ": 585,
      "##з": 586,
      "##р": 587,
      "##ʻ": 588,
      "##ѕ": 589,
      "##ф": 590,
      "##ˮ": 591,
      "##①": 592,
      "##π": 593,
      "##χ": 594,
      "##ﬃ": 595,
      "##п": 596,
      "##ι": 597,
      "##σ": 598,
      "##࿸": 599,
      "##đ": 600,
      "##о": 601,
      "##ĸ": 602,
      "##∗": 603,
      "##ˡ": 604,
      "##ⅱ": 605,
      "##η": 606,
      "##er": 607,
      "th": 608,
      "##ti": 609,
      "##on": 610,
      "##es": 611,
      "the": 612,
      "##ed": 613,
      "##en": 614,
      "##an": 615,
      "##in": 616,
      "in": 617,
      "##or": 618,
      "of": 619,
      "an": 620,
      "##al": 621,
      "##at": 622,
      "##ar": 623,
      "and": 624,
      "##tion": 625,
      "##ur": 626,
      "##ent": 627,
      "##om": 628,
      "##ec": 629,
      "##it": 630,
      "to": 631,
      "##ing": 632,
      "##ic": 633,
      "##as": 634,
      "re": 635,
      "pr": 636,
      "##is": 637,
      "##em": 638,
      "##il": 639,
      "com": 640,
      "##ts": 641,
      "##re": 642,
      "##ation": 643,
      "as": 644,
      "for": 645,
      "##ve": 646,
      "comp": 647,
      "##ol": 648,
      "##ou": 649,
      "20": 650,
      "con": 651,
      "##ly": 652,
      "st": 653,
      "##et": 654,
      "##anc": 655,
      "pro": 656,
      "##ir": 657,
      "##st": 658,
      "ex": 659,
      "inc": 660,
      "##id": 661,
      "##ement": 662,
      "##ac": 663,
      "our": 664,
      "##tin": 665,
      "on": 666,
      "ac": 667,
      "or": 668,
      "##ers": 669,
      "##le": 670,
      "##ate": 671,
      "##ment": 672,
      "##os": 673,
      "##ated": 674,
      "##li": 675,
      "compan": 676,
      "##ab": 677,
      "no": 678,
      "##uc": 679,
      "##ting": 680,
      "be": 681,
      "##th": 682,
      "company": 683,
      "##ter": 684,
      "##ul": 685,
      "is": 686,
      "##qu": 687,
      "##ial": 688,
      "##ect": 689,
      "res": 690,
      "we": 691,
      "##lo": 692,
      "##ith": 693,
      "200": 694,
      "##tr": 695,
      "##im": 696,
      "##nd": 697,
      "de": 698,
      "##ess": 699,
      "##ity": 700,
      "with": 701,
      "##ay": 702,
      "are": 703,
      "##per": 704,
      "##ain": 705,
      "##ber": 706,
      "by": 707,
      "##oc": 708,
      "not": 709,
      "##se": 710,
      "wh": 711,
      "fin": 712,
      "##ig": 713,
      "su": 714,
      "##ver": 715,
      "that": 716,
      "##tive": 717,
      "##ag": 718,
      "##oun": 719,
      "201": 720,
      "ad": 721,
      "##por": 722,
      "##ties": 723,
      "##est": 724,
      "financ": 725,
      "##ue": 726,
      "##ud": 727,
      "##ations": 728,
      "al": 729,
      "##ition": 730,
      "sh": 731,
      "##able": 732,
      "dec": 733,
      "##pr": 734,
      "acc": 735,
      "fr": 736,
      "##ance": 737,
      "per": 738,
      "##ch": 739,
      "##ff": 740,
      "financial": 741,
      "##illi": 742,
      "##ember": 743,
      "##illion": 744,
      "##ip": 745,
      "at": 746,
      "##ear": 747,
      "##ements": 748,
      "million": 749,
      "##us": 750,
      "##od": 751,
      "##ant": 752,
      "rec": 753,
      "exp": 754,
      "from": 755,
      "19": 756,
      "##ut": 757,
      "comm": 758,
      "inter": 759,
      "##ther": 760,
      "oper": 761,
      "stat": 762,
      "##el": 763,
      "##fic": 764,
      "am": 765,
      "##iv": 766,
      "##ust": 767,
      "##end": 768,
      "mar": 769,
      "cons": 770,
      "##mp": 771,
      "tr": 772,
      "ap": 773,
      "ch": 774,
      "##ock": 775,
      "un": 776,
      "##ities": 777,
      "ha": 778,
      "par": 779,
      "##ase": 780,
      "##ib": 781,
      "##ere": 782,
      "##ce": 783,
      "year": 784,
      "##ies": 785,
      "stock": 786,
      "ag": 787,
      "##ion": 788,
      "dis": 789,
      "31": 790,
      "##ich": 791,
      "##and": 792,
      "##lud": 793,
      "##tain": 794,
      "en": 795,
      "december": 796,
      "##ang": 797,
      "other": 798,
      "##duc": 799,
      "which": 800,
      "sub": 801,
      "##for": 802,
      "##ure": 803,
      "##low": 804,
      "##ans": 805,
      "199": 806,
      "man": 807,
      "##ow": 808,
      "##tions": 809,
      "##ted": 810,
      "includ": 811,
      "##ens": 812,
      "ser": 813,
      "##ary": 814,
      "shar": 815,
      "##um": 816,
      "##red": 817,
      "##ard": 818,
      "##ased": 819,
      "##ill": 820,
      "may": 821,
      "##00": 822,
      "##ap": 823,
      "##ad": 824,
      "##erm": 825,
      "ass": 826,
      "sec": 827,
      "produc": 828,
      "##iz": 829,
      "pl": 830,
      "have": 831,
      "##ome": 832,
      "val": 833,
      "und": 834,
      "its": 835,
      "##dition": 836,
      "##ual": 837,
      "contr": 838,
      "reg": 839,
      "ta": 840,
      "se": 841,
      "##fer": 842,
      "mark": 843,
      "inv": 844,
      "li": 845,
      "under": 846,
      "serv": 847,
      "le": 848,
      "##ments": 849,
      "##am": 850,
      "resul": 851,
      "was": 852,
      "##act": 853,
      "##pro": 854,
      "##ility": 855,
      "##ign": 856,
      "##ors": 857,
      "##ld": 858,
      "co": 859,
      "rel": 860,
      "##old": 861,
      "us": 862,
      "ind": 863,
      "##ese": 864,
      "##form": 865,
      "##ating": 866,
      "requ": 867,
      "rev": 868,
      "tax": 869,
      "suc": 870,
      "accoun": 871,
      "prov": 872,
      "servic": 873,
      "##eral": 874,
      "repor": 875,
      "##ould": 876,
      "##age": 877,
      "pur": 878,
      "##air": 879,
      "these": 880,
      "ne": 881,
      "agre": 882,
      "part": 883,
      "statements": 884,
      "##oss": 885,
      "gr": 886,
      "cas": 887,
      "sal": 888,
      "##ates": 889,
      "this": 890,
      "##igh": 891,
      "appro": 892,
      "##og": 893,
      "it": 894,
      "any": 895,
      "##iness": 896,
      "will": 897,
      "bus": 898,
      "business": 899,
      "end": 900,
      "000": 901,
      "##tic": 902,
      "net": 903,
      "value": 904,
      "incre": 905,
      "##su": 906,
      "manag": 907,
      "mat": 908,
      "income": 909,
      "interest": 910,
      "int": 911,
      "eff": 912,
      "##ective": 913,
      "cash": 914,
      "op": 915,
      "such": 916,
      "term": 917,
      "lo": 918,
      "##uring": 919,
      "##sets": 920,
      "assets": 921,
      "gen": 922,
      "equ": 923,
      "cap": 924,
      "cl": 925,
      "operations": 926,
      "cer": 927,
      "##olid": 928,
      "has": 929,
      "##un": 930,
      "10": 931,
      "##ord": 932,
      "requir": 933,
      "amoun": 934,
      "secur": 935,
      "pay": 936,
      "##irect": 937,
      "consolid": 938,
      "addition": 939,
      "invest": 940,
      "##urr": 941,
      "##ific": 942,
      "resp": 943,
      "imp": 944,
      "##orpor": 945,
      "all": 946,
      "market": 947,
      "ab": 948,
      "direct": 949,
      "provid": 950,
      "were": 951,
      "common": 952,
      "based": 953,
      "##its": 954,
      "pric": 955,
      "##ru": 956,
      "##ail": 957,
      "##iod": 958,
      "consolidated": 959,
      "##ings": 960,
      "period": 961,
      "##ital": 962,
      "##ee": 963,
      "##sti": 964,
      "related": 965,
      "management": 966,
      "disc": 967,
      "ended": 968,
      "reven": 969,
      "trans": 970,
      "loss": 971,
      "##tial": 972,
      "certain": 973,
      "shares": 974,
      "##ized": 975,
      "acqu": 976,
      "##ty": 977,
      "agreement": 978,
      "curr": 979,
      "##gh": 980,
      "pre": 981,
      "cos": 982,
      "##ach": 983,
      "##ous": 984,
      "##lic": 985,
      "over": 986,
      "##ately": 987,
      "chang": 988,
      "costs": 989,
      "share": 990,
      "##ence": 991,
      "##ative": 992,
      "capital": 993,
      "sp": 994,
      "##ited": 995,
      "##xim": 996,
      "products": 997,
      "cust": 998,
      "##ners": 999,
      "##ef": 1000,
      "##ical": 1001,
      "##tiv": 1002,
      "if": 1003,
      "##enc": 1004,
      "during": 1005,
      "##ough": 1006,
      "cred": 1007,
      "years": 1008,
      "##ents": 1009,
      "custom": 1010,
      "##ures": 1011,
      "##ank": 1012,
      "bo": 1013,
      "##hip": 1014,
      "general": 1015,
      "services": 1016,
      "fair": 1017,
      "offic": 1018,
      "ob": 1019,
      "##velo": 1020,
      "plan": 1021,
      "##so": 1022,
      "up": 1023,
      "##velop": 1024,
      "sales": 1025,
      "##ected": 1026,
      "##ine": 1027,
      "tim": 1028,
      "mor": 1029,
      "issu": 1030,
      "sign": 1031,
      "##loy": 1032,
      "could": 1033,
      "accounting": 1034,
      "including": 1035,
      "form": 1036,
      "develop": 1037,
      "operating": 1038,
      "fol": 1039,
      "##ilities": 1040,
      "follow": 1041,
      "app": 1042,
      "regul": 1043,
      "credit": 1044,
      "new": 1045,
      "##oll": 1046,
      "fut": 1047,
      "ow": 1048,
      "esti": 1049,
      "estim": 1050,
      "emp": 1051,
      "purch": 1052,
      "##arg": 1053,
      "##ory": 1054,
      "ev": 1055,
      "##isc": 1056,
      "approxim": 1057,
      "also": 1058,
      "fac": 1059,
      "##ior": 1060,
      "employ": 1061,
      "securities": 1062,
      "liab": 1063,
      "adv": 1064,
      "##erial": 1065,
      "##ong": 1066,
      "##pos": 1067,
      "fe": 1068,
      "notes": 1069,
      "bank": 1070,
      "##pt": 1071,
      "rate": 1072,
      "future": 1073,
      "pres": 1074,
      "qu": 1075,
      "ris": 1076,
      "current": 1077,
      "##ense": 1078,
      "material": 1079,
      "proper": 1080,
      "results": 1081,
      "contin": 1082,
      "go": 1083,
      "rece": 1084,
      "##cess": 1085,
      "##our": 1086,
      "##und": 1087,
      "approximately": 1088,
      "##ot": 1089,
      "thr": 1090,
      "##arr": 1091,
      "risk": 1092,
      "##gr": 1093,
      "##iscal": 1094,
      "non": 1095,
      "fiscal": 1096,
      "aff": 1097,
      "inform": 1098,
      "been": 1099,
      "##ferred": 1100,
      "information": 1101,
      "ann": 1102,
      "subs": 1103,
      "##ive": 1104,
      "there": 1105,
      "item": 1106,
      "time": 1107,
      "##ificant": 1108,
      "through": 1109,
      "##if": 1110,
      "##are": 1111,
      "##op": 1112,
      "control": 1113,
      "significant": 1114,
      "ma": 1115,
      "fil": 1116,
      "##erc": 1117,
      "intern": 1118,
      "corpor": 1119,
      "det": 1120,
      "ben": 1121,
      "##ject": 1122,
      "##hold": 1123,
      "red": 1124,
      "due": 1125,
      "additional": 1126,
      "##all": 1127,
      "##istr": 1128,
      "##aw": 1129,
      "price": 1130,
      "##ily": 1131,
      "amount": 1132,
      "##tal": 1133,
      "##ke": 1134,
      "prim": 1135,
      "their": 1136,
      "each": 1137,
      "than": 1138,
      "##ied": 1139,
      "##ose": 1140,
      "##nership": 1141,
      "##trib": 1142,
      "me": 1143,
      "##inc": 1144,
      "fund": 1145,
      "##ues": 1146,
      "##idi": 1147,
      "##ision": 1148,
      "##uts": 1149,
      "total": 1150,
      "lim": 1151,
      "##enses": 1152,
      "sup": 1153,
      "subsidi": 1154,
      "result": 1155,
      "cost": 1156,
      "30": 1157,
      "##ll": 1158,
      "act": 1159,
      "deb": 1160,
      "##ech": 1161,
      "bas": 1162,
      "date": 1163,
      "increase": 1164,
      "##ogn": 1165,
      "##urance": 1166,
      "compens": 1167,
      "exec": 1168,
      "15": 1169,
      "can": 1170,
      "##ell": 1171,
      "##ectively": 1172,
      "report": 1173,
      "princ": 1174,
      "princip": 1175,
      "##ork": 1176,
      "##ass": 1177,
      "sy": 1178,
      "mon": 1179,
      "##ined": 1180,
      "condition": 1181,
      "ear": 1182,
      "ar": 1183,
      "##ange": 1184,
      "following": 1185,
      "##ants": 1186,
      "record": 1187,
      "des": 1188,
      "##isition": 1189,
      "compensation": 1190,
      "acquisition": 1191,
      "revenue": 1192,
      "##ia": 1193,
      "br": 1194,
      "into": 1195,
      "perform": 1196,
      "##ist": 1197,
      "##ise": 1198,
      "##sion": 1199,
      "recogn": 1200,
      "##utive": 1201,
      "subject": 1202,
      "##ep": 1203,
      "directors": 1204,
      "##arter": 1205,
      "expenses": 1206,
      "annual": 1207,
      "loan": 1208,
      "##ards": 1209,
      "equity": 1210,
      "##eth": 1211,
      "##lig": 1212,
      "##arily": 1213,
      "str": 1214,
      "hold": 1215,
      "expense": 1216,
      "ins": 1217,
      "changes": 1218,
      "receiv": 1219,
      "transac": 1220,
      "outs": 1221,
      "do": 1222,
      "debt": 1223,
      "##olog": 1224,
      "oc": 1225,
      "loans": 1226,
      "##echn": 1227,
      "##erse": 1228,
      "##ases": 1229,
      "##erg": 1230,
      "note": 1231,
      "marke": 1232,
      "required": 1233,
      "av": 1234,
      "development": 1235,
      "##ire": 1236,
      "##ution": 1237,
      "investment": 1238,
      "determ": 1239,
      "##ivid": 1240,
      "##ari": 1241,
      "techn": 1242,
      "##ection": 1243,
      "12": 1244,
      "##stem": 1245,
      "pa": 1246,
      "own": 1247,
      "benef": 1248,
      "purchase": 1249,
      "au": 1250,
      "##ower": 1251,
      "est": 1252,
      "def": 1253,
      "executive": 1254,
      "customers": 1255,
      "##ade": 1256,
      "##ie": 1257,
      "product": 1258,
      "aud": 1259,
      "system": 1260,
      "reporting": 1261,
      "board": 1262,
      "por": 1263,
      "he": 1264,
      "quarter": 1265,
      "##anding": 1266,
      "distrib": 1267,
      "more": 1268,
      "exch": 1269,
      "##ub": 1270,
      "one": 1271,
      "primarily": 1272,
      "bal": 1273,
      "reduc": 1274,
      "##les": 1275,
      "flow": 1276,
      "basis": 1277,
      "di": 1278,
      "##ons": 1279,
      "upon": 1280,
      "issued": 1281,
      "##ree": 1282,
      "activ": 1283,
      "respectively": 1284,
      "applic": 1285,
      "rem": 1286,
      "high": 1287,
      "statement": 1288,
      "el": 1289,
      "amounts": 1290,
      "compar": 1291,
      "liabilities": 1292,
      "##ish": 1293,
      "vari": 1294,
      "##verage": 1295,
      "##ceed": 1296,
      "fir": 1297,
      "##aries": 1298,
      "##port": 1299,
      "##ying": 1300,
      "rep": 1301,
      "im": 1302,
      "exchange": 1303,
      "##ational": 1304,
      "##ible": 1305,
      "would": 1306,
      "included": 1307,
      "use": 1308,
      "service": 1309,
      "increased": 1310,
      "avail": 1311,
      "real": 1312,
      "spec": 1313,
      "main": 1314,
      "inst": 1315,
      "commit": 1316,
      "rates": 1317,
      "2008": 1318,
      "earn": 1319,
      "##holders": 1320,
      "2009": 1321,
      "bec": 1322,
      "decre": 1323,
      "corporation": 1324,
      "partnership": 1325,
      "adverse": 1326,
      "beli": 1327,
      "##ees": 1328,
      "property": 1329,
      "restr": 1330,
      "revenues": 1331,
      "##ects": 1332,
      "##vel": 1333,
      "law": 1334,
      "##eld": 1335,
      "march": 1336,
      "2007": 1337,
      "oblig": 1338,
      "options": 1339,
      "long": 1340,
      "2006": 1341,
      "##au": 1342,
      "##hib": 1343,
      "belie": 1344,
      "principal": 1345,
      "##ances": 1346,
      "outst": 1347,
      "outstanding": 1348,
      "13": 1349,
      "##ustr": 1350,
      "##ight": 1351,
      "2010": 1352,
      "well": 1353,
      "see": 1354,
      "num": 1355,
      "##out": 1356,
      "pol": 1357,
      "progr": 1358,
      "filed": 1359,
      "##ential": 1360,
      "enter": 1361,
      "##ast": 1362,
      "losses": 1363,
      "##cr": 1364,
      "effective": 1365,
      "##oci": 1366,
      "##orr": 1367,
      "14": 1368,
      "##eti": 1369,
      "continu": 1370,
      "incorpor": 1371,
      "amend": 1372,
      "ref": 1373,
      "prior": 1374,
      "##anu": 1375,
      "coll": 1376,
      "technolog": 1377,
      "##ticip": 1378,
      "enti": 1379,
      "jun": 1380,
      "sale": 1381,
      "loc": 1382,
      "subsidiaries": 1383,
      "used": 1384,
      "2011": 1385,
      "stand": 1386,
      "carr": 1387,
      "##ified": 1388,
      "2005": 1389,
      "ret": 1390,
      "##ond": 1391,
      "recorded": 1392,
      "diff": 1393,
      "pub": 1394,
      "generally": 1395,
      "associ": 1396,
      "accord": 1397,
      "refer": 1398,
      "provide": 1399,
      "janu": 1400,
      "january": 1401,
      "internal": 1402,
      "11": 1403,
      "fed": 1404,
      "2002": 1405,
      "##fact": 1406,
      "##ission": 1407,
      "2004": 1408,
      "those": 1409,
      "include": 1410,
      "##par": 1411,
      "impair": 1412,
      "mr": 1413,
      "facility": 1414,
      "off": 1415,
      "##los": 1416,
      "officer": 1417,
      "##cent": 1418,
      "allow": 1419,
      "federal": 1420,
      "registr": 1421,
      "bet": 1422,
      "had": 1423,
      "2003": 1424,
      "industr": 1425,
      "june": 1426,
      "##ati": 1427,
      "##uct": 1428,
      "##fter": 1429,
      "supp": 1430,
      "##ves": 1431,
      "2013": 1432,
      "2012": 1433,
      "program": 1434,
      "requirements": 1435,
      "##ack": 1436,
      "##utions": 1437,
      "ii": 1438,
      "manu": 1439,
      "competi": 1440,
      "manufact": 1441,
      "2014": 1442,
      "grant": 1443,
      "available": 1444,
      "##we": 1445,
      "2000": 1446,
      "effect": 1447,
      "##ix": 1448,
      "level": 1449,
      "##lement": 1450,
      "##ination": 1451,
      "charg": 1452,
      "##gin": 1453,
      "balance": 1454,
      "pos": 1455,
      "fact": 1456,
      "##tiz": 1457,
      "states": 1458,
      "gu": 1459,
      "month": 1460,
      "class": 1461,
      "##ved": 1462,
      "contract": 1463,
      "2001": 1464,
      "qual": 1465,
      "ability": 1466,
      "tw": 1467,
      "##ata": 1468,
      "when": 1469,
      "consid": 1470,
      "insurance": 1471,
      "##ability": 1472,
      "companies": 1473,
      "activities": 1474,
      "mo": 1475,
      "public": 1476,
      "pers": 1477,
      "number": 1478,
      "set": 1479,
      "##ause": 1480,
      "##ame": 1481,
      "asset": 1482,
      "polic": 1483,
      "##ends": 1484,
      "##atory": 1485,
      "exhib": 1486,
      "##min": 1487,
      "offer": 1488,
      "limited": 1489,
      "2015": 1490,
      "present": 1491,
      "adj": 1492,
      "##ite": 1493,
      "agreements": 1494,
      "gas": 1495,
      "disclos": 1496,
      "deferred": 1497,
      "##urn": 1498,
      "##ween": 1499,
      "between": 1500,
      "investments": 1501,
      "impact": 1502,
      "united": 1503,
      "prof": 1504,
      "2016": 1505,
      "1999": 1506,
      "##av": 1507,
      "seg": 1508,
      "incorporated": 1509,
      "##aim": 1510,
      "estimated": 1511,
      "divid": 1512,
      "compared": 1513,
      "cr": 1514,
      "1998": 1515,
      "process": 1516,
      "data": 1517,
      "min": 1518,
      "after": 1519,
      "employees": 1520,
      "##ipment": 1521,
      "expected": 1522,
      "performance": 1523,
      "terms": 1524,
      "lease": 1525,
      "##oin": 1526,
      "repr": 1527,
      "trad": 1528,
      "sept": 1529,
      "september": 1530,
      "ph": 1531,
      "25": 1532,
      "##ency": 1533,
      "##io": 1534,
      "##ason": 1535,
      "thir": 1536,
      "sell": 1537,
      "reference": 1538,
      "##ide": 1539,
      "##lish": 1540,
      "pursu": 1541,
      "##con": 1542,
      "option": 1543,
      "transactions": 1544,
      "##acts": 1545,
      "1997": 1546,
      "flows": 1547,
      "adjust": 1548,
      "claim": 1549,
      "##ys": 1550,
      "payments": 1551,
      "##vern": 1552,
      "consider": 1553,
      "recognized": 1554,
      "paid": 1555,
      "subst": 1556,
      "position": 1557,
      "govern": 1558,
      "meas": 1559,
      "equipment": 1560,
      "##alu": 1561,
      "repres": 1562,
      "##ace": 1563,
      "lic": 1564,
      "##isting": 1565,
      "state": 1566,
      "third": 1567,
      "proceed": 1568,
      "##ortiz": 1569,
      "sch": 1570,
      "customer": 1571,
      "##own": 1572,
      "percent": 1573,
      "provision": 1574,
      "ord": 1575,
      "made": 1576,
      "##oup": 1577,
      "reser": 1578,
      "first": 1579,
      "average": 1580,
      "ext": 1581,
      "##ters": 1582,
      "##ercial": 1583,
      "restric": 1584,
      "fees": 1585,
      "change": 1586,
      "earnings": 1587,
      "commercial": 1588,
      "accounts": 1589,
      "pursuant": 1590,
      "cal": 1591,
      "fore": 1592,
      "trust": 1593,
      "evalu": 1594,
      "so": 1595,
      "design": 1596,
      "taxes": 1597,
      "##ident": 1598,
      "##to": 1599,
      "borr": 1600,
      "liability": 1601,
      "##thor": 1602,
      "##ateg": 1603,
      "##ok": 1604,
      "good": 1605,
      "acquir": 1606,
      "##ourc": 1607,
      "1996": 1608,
      "contracts": 1609,
      "incur": 1610,
      "less": 1611,
      "estimates": 1612,
      "##endent": 1613,
      "prev": 1614,
      "##tg": 1615,
      "meth": 1616,
      "gener": 1617,
      "factors": 1618,
      "audit": 1619,
      "coun": 1620,
      "amortiz": 1621,
      "differ": 1622,
      "aw": 1623,
      "2017": 1624,
      "three": 1625,
      "method": 1626,
      "der": 1627,
      "instru": 1628,
      "##ights": 1629,
      "exerc": 1630,
      "continued": 1631,
      "impairment": 1632,
      "mortg": 1633,
      "within": 1634,
      "properties": 1635,
      "obligations": 1636,
      "remain": 1637,
      "##over": 1638,
      "substan": 1639,
      "sen": 1640,
      "exper": 1641,
      "conn": 1642,
      "med": 1643,
      "dep": 1644,
      "maintain": 1645,
      "##ft": 1646,
      "##iew": 1647,
      "##ful": 1648,
      "##ex": 1649,
      "foreign": 1650,
      "conditions": 1651,
      "director": 1652,
      "##reat": 1653,
      "##uly": 1654,
      "author": 1655,
      "group": 1656,
      "associated": 1657,
      "two": 1658,
      "##ergy": 1659,
      "substantial": 1660,
      "##ten": 1661,
      "grow": 1662,
      "senior": 1663,
      "16": 1664,
      "rights": 1665,
      "##fe": 1666,
      "affect": 1667,
      "reason": 1668,
      "##gan": 1669,
      "compl": 1670,
      "deriv": 1671,
      "currently": 1672,
      "facilities": 1673,
      "##ablish": 1674,
      "regulatory": 1675,
      "ful": 1676,
      "establish": 1677,
      "##tical": 1678,
      "leg": 1679,
      "pot": 1680,
      "systems": 1681,
      "dr": 1682,
      "##ief": 1683,
      "markets": 1684,
      "##ources": 1685,
      "plans": 1686,
      "mod": 1687,
      "feb": 1688,
      "exhibit": 1689,
      "dated": 1690,
      "payment": 1691,
      "pat": 1692,
      "febru": 1693,
      "february": 1694,
      "##ured": 1695,
      "##reg": 1696,
      "prices": 1697,
      "periods": 1698,
      "vol": 1699,
      "various": 1700,
      "##ner": 1701,
      "occ": 1702,
      "gain": 1703,
      "using": 1704,
      "benefit": 1705,
      "chief": 1706,
      "obtain": 1707,
      "provided": 1708,
      "energy": 1709,
      "table": 1710,
      "##ced": 1711,
      "##edg": 1712,
      "includes": 1713,
      "president": 1714,
      "##ile": 1715,
      "potential": 1716,
      "standards": 1717,
      "nat": 1718,
      "##ice": 1719,
      "admin": 1720,
      "party": 1721,
      "##ands": 1722,
      "valu": 1723,
      "##iation": 1724,
      "owned": 1725,
      "##cer": 1726,
      "##uted": 1727,
      "##ning": 1728,
      "continue": 1729,
      "elect": 1730,
      "warr": 1731,
      "mortgage": 1732,
      "person": 1733,
      "##ving": 1734,
      "acquired": 1735,
      "how": 1736,
      "refl": 1737,
      "officers": 1738,
      "held": 1739,
      "work": 1740,
      "discus": 1741,
      "nor": 1742,
      "##ump": 1743,
      "##ines": 1744,
      "regulations": 1745,
      "##ult": 1746,
      "borrow": 1747,
      "##quid": 1748,
      "econ": 1749,
      "industry": 1750,
      "accordance": 1751,
      "indep": 1752,
      "econom": 1753,
      "believe": 1754,
      "applicable": 1755,
      "below": 1756,
      "##verti": 1757,
      "preferred": 1758,
      "ini": 1759,
      "##ici": 1760,
      "existing": 1761,
      "technology": 1762,
      "but": 1763,
      "instruments": 1764,
      "units": 1765,
      "out": 1766,
      "assess": 1767,
      "claims": 1768,
      "liquid": 1769,
      "make": 1770,
      "adop": 1771,
      "port": 1772,
      "##fore": 1773,
      "##ize": 1774,
      "stockholders": 1775,
      "uti": 1776,
      "committ": 1777,
      "##ound": 1778,
      "decrease": 1779,
      "sum": 1780,
      "experi": 1781,
      "depos": 1782,
      "##tober": 1783,
      "october": 1784,
      "sol": 1785,
      "##liance": 1786,
      "marketing": 1787,
      "connection": 1788,
      "sin": 1789,
      "segment": 1790,
      "administr": 1791,
      "##ey": 1792,
      "anal": 1793,
      "##val": 1794,
      "ll": 1795,
      "received": 1796,
      "purpos": 1797,
      "##tives": 1798,
      "sf": 1799,
      "##alth": 1800,
      "day": 1801,
      "registrant": 1802,
      "nov": 1803,
      "apr": 1804,
      "1995": 1805,
      "##ove": 1806,
      "decl": 1807,
      "18": 1808,
      "financing": 1809,
      "laws": 1810,
      "##omp": 1811,
      "require": 1812,
      "april": 1813,
      "power": 1814,
      "regard": 1815,
      "##ization": 1816,
      "##loc": 1817,
      "##vir": 1818,
      "##tig": 1819,
      "benefits": 1820,
      "id": 1821,
      "since": 1822,
      "##mit": 1823,
      "distribution": 1824,
      "determined": 1825,
      "sim": 1826,
      "july": 1827,
      "##ore": 1828,
      "electr": 1829,
      "sfas": 1830,
      "funds": 1831,
      "##ending": 1832,
      "cour": 1833,
      "##tif": 1834,
      "envir": 1835,
      "##ever": 1836,
      "commission": 1837,
      "environ": 1838,
      "##greg": 1839,
      "arr": 1840,
      "##fol": 1841,
      "because": 1842,
      "committee": 1843,
      "comb": 1844,
      "##mental": 1845,
      "independent": 1846,
      "##work": 1847,
      "dem": 1848,
      "eng": 1849,
      "##yp": 1850,
      "portfol": 1851,
      "strateg": 1852,
      "fur": 1853,
      "aggreg": 1854,
      "production": 1855,
      "offs": 1856,
      "particip": 1857,
      "##oint": 1858,
      "##ili": 1859,
      "here": 1860,
      "further": 1861,
      "17": 1862,
      "sold": 1863,
      "again": 1864,
      "sched": 1865,
      "health": 1866,
      "##da": 1867,
      "growth": 1868,
      "complet": 1869,
      "respect": 1870,
      "policies": 1871,
      "return": 1872,
      "50": 1873,
      "##str": 1874,
      "provides": 1875,
      "##ether": 1876,
      "##eric": 1877,
      "above": 1878,
      "incurred": 1879,
      "corporate": 1880,
      "estate": 1881,
      "success": 1882,
      "impro": 1883,
      "##ural": 1884,
      "four": 1885,
      "##ware": 1886,
      "november": 1887,
      "both": 1888,
      "larg": 1889,
      "exc": 1890,
      "##earch": 1891,
      "inf": 1892,
      "fl": 1893,
      "##stit": 1894,
      "indic": 1895,
      "##ort": 1896,
      "review": 1897,
      "against": 1898,
      "##will": 1899,
      "risks": 1900,
      "follows": 1901,
      "consum": 1902,
      "##ests": 1903,
      "series": 1904,
      "aug": 1905,
      "##ages": 1906,
      "oil": 1907,
      "entered": 1908,
      "del": 1909,
      "##ble": 1910,
      "some": 1911,
      "amended": 1912,
      "they": 1913,
      "assump": 1914,
      "sc": 1915,
      "employee": 1916,
      "goodwill": 1917,
      "contrib": 1918,
      "dividends": 1919,
      "bu": 1920,
      "##ules": 1921,
      "security": 1922,
      "adversely": 1923,
      "##sp": 1924,
      "##ious": 1925,
      "portfolio": 1926,
      "28": 1927,
      "reported": 1928,
      "lower": 1929,
      "##ically": 1930,
      "portion": 1931,
      "2018": 1932,
      "august": 1933,
      "subsidiary": 1934,
      "##esting": 1935,
      "approval": 1936,
      "##tific": 1937,
      "order": 1938,
      "##quent": 1939,
      "##tern": 1940,
      "fix": 1941,
      "ro": 1942,
      "hist": 1943,
      "proced": 1944,
      "arrang": 1945,
      "carrying": 1946,
      "##ensive": 1947,
      "does": 1948,
      "typ": 1949,
      "summ": 1950,
      "however": 1951,
      "account": 1952,
      "recover": 1953,
      "##uction": 1954,
      "thous": 1955,
      "maj": 1956,
      "section": 1957,
      "need": 1958,
      "economic": 1959,
      "##ecess": 1960,
      "##arm": 1961,
      "##encies": 1962,
      "transaction": 1963,
      "line": 1964,
      "##pri": 1965,
      "fail": 1966,
      "aggregate": 1967,
      "contain": 1968,
      "research": 1969,
      "21": 1970,
      "##ven": 1971,
      "americ": 1972,
      "major": 1973,
      "iden": 1974,
      "among": 1975,
      "payable": 1976,
      "compliance": 1977,
      "sever": 1978,
      "sett": 1979,
      "##inated": 1980,
      "instit": 1981,
      "ownership": 1982,
      "only": 1983,
      "higher": 1984,
      "deli": 1985,
      "cent": 1986,
      "invent": 1987,
      "international": 1988,
      "limit": 1989,
      "##ompan": 1990,
      "granted": 1991,
      "##prec": 1992,
      "compon": 1993,
      "prot": 1994,
      "##ak": 1995,
      "hedg": 1996,
      "##ward": 1997,
      "affili": 1998,
      "po": 1999,
      "leases": 2000,
      "profit": 2001,
      "relations": 2002,
      "legal": 2003,
      "##crib": 2004,
      "procedures": 2005,
      "##ule": 2006,
      "##ension": 2007,
      "allowance": 2008,
      "specific": 2009,
      "defined": 2010,
      "assumptions": 2011,
      "deliver": 2012,
      "analys": 2013,
      "soft": 2014,
      "guar": 2015,
      "valuation": 2016,
      "##egr": 2017,
      "exce": 2018,
      "life": 2019,
      "fixed": 2020,
      "about": 2021,
      "regarding": 2022,
      "controls": 2023,
      "utili": 2024,
      "guarant": 2025,
      "##led": 2026,
      "##ulated": 2027,
      "provisions": 2028,
      "offset": 2029,
      "proceeds": 2030,
      "neg": 2031,
      "respons": 2032,
      "disclosure": 2033,
      "commun": 2034,
      "##her": 2035,
      "resources": 2036,
      "integr": 2037,
      "##ised": 2038,
      "intang": 2039,
      "22": 2040,
      "assurance": 2041,
      "##ular": 2042,
      "24": 2043,
      "previous": 2044,
      "##vers": 2045,
      "##inion": 2046,
      "matur": 2047,
      "29": 2048,
      "months": 2049,
      "100": 2050,
      "whol": 2051,
      "represent": 2052,
      "manufacturing": 2053,
      "conduc": 2054,
      "##rement": 2055,
      "##ilar": 2056,
      "##man": 2057,
      "most": 2058,
      "##als": 2059,
      "natural": 2060,
      "purposes": 2061,
      "##ollar": 2062,
      "requires": 2063,
      "software": 2064,
      "27": 2065,
      "##nel": 2066,
      "invol": 2067,
      "begin": 2068,
      "similar": 2069,
      "shareholders": 2070,
      "expect": 2071,
      "rest": 2072,
      "reasonable": 2073,
      "constr": 2074,
      "##til": 2075,
      "parties": 2076,
      "##unc": 2077,
      "##ium": 2078,
      "##irc": 2079,
      "##one": 2080,
      "23": 2081,
      "where": 2082,
      "incen": 2083,
      "minim": 2084,
      "##ness": 2085,
      "llc": 2086,
      "unit": 2087,
      "discoun": 2088,
      "gross": 2089,
      "wr": 2090,
      "circ": 2091,
      "liv": 2092,
      "proj": 2093,
      "##ute": 2094,
      "dollar": 2095,
      "matters": 2096,
      "opinion": 2097,
      "histor": 2098,
      "partners": 2099,
      "fas": 2100,
      "exercise": 2101,
      "accru": 2102,
      "dispos": 2103,
      "thousands": 2104,
      "anticip": 2105,
      "alloc": 2106,
      "remaining": 2107,
      "##inical": 2108,
      "amortization": 2109,
      "initial": 2110,
      "administrative": 2111,
      "necess": 2112,
      "clos": 2113,
      "##ables": 2114,
      "restricted": 2115,
      "actual": 2116,
      "network": 2117,
      "being": 2118,
      "sel": 2119,
      "orig": 2120,
      "short": 2121,
      "acquisitions": 2122,
      "until": 2123,
      "rent": 2124,
      "##ety": 2125,
      "like": 2126,
      "expend": 2127,
      "able": 2128,
      "198": 2129,
      "partner": 2130,
      "relationship": 2131,
      "whether": 2132,
      "issuance": 2133,
      "demand": 2134,
      "##sequent": 2135,
      "accompan": 2136,
      "26": 2137,
      "##dr": 2138,
      "herein": 2139,
      "33": 2140,
      "support": 2141,
      "stor": 2142,
      "merg": 2143,
      "analysis": 2144,
      "resulting": 2145,
      "##ivers": 2146,
      "priv": 2147,
      "##ences": 2148,
      "##preciation": 2149,
      "relating": 2150,
      "national": 2151,
      "license": 2152,
      "em": 2153,
      "40": 2154,
      "##ividual": 2155,
      "individual": 2156,
      "##asing": 2157,
      "while": 2158,
      "she": 2159,
      "vice": 2160,
      "forth": 2161,
      "##ival": 2162,
      "experience": 2163,
      "trading": 2164,
      "event": 2165,
      "accompanying": 2166,
      "occur": 2167,
      "government": 2168,
      "##ict": 2169,
      "##ister": 2170,
      "events": 2171,
      "sa": 2172,
      "same": 2173,
      "believes": 2174,
      "1994": 2175,
      "retail": 2176,
      "te": 2177,
      "local": 2178,
      "organ": 2179,
      "awards": 2180,
      "quarterly": 2181,
      "##king": 2182,
      "##ield": 2183,
      "##itures": 2184,
      "##pl": 2185,
      "pen": 2186,
      "receivable": 2187,
      "five": 2188,
      "##tigation": 2189,
      "excess": 2190,
      "discussion": 2191,
      "##less": 2192,
      "who": 2193,
      "guid": 2194,
      "environmental": 2195,
      "accrued": 2196,
      "##emb": 2197,
      "##icient": 2198,
      "intangible": 2199,
      "##tirement": 2200,
      "##ian": 2201,
      "currency": 2202,
      "prem": 2203,
      "second": 2204,
      "offering": 2205,
      "##ither": 2206,
      "equival": 2207,
      "derivative": 2208,
      "##holder": 2209,
      "full": 2210,
      "##certain": 2211,
      "consist": 2212,
      "clinical": 2213,
      "incentive": 2214,
      "meet": 2215,
      "equal": 2216,
      "established": 2217,
      "certific": 2218,
      "many": 2219,
      "interests": 2220,
      "prom": 2221,
      "##ild": 2222,
      "##cribed": 2223,
      "reserves": 2224,
      "##udg": 2225,
      "##ater": 2226,
      "court": 2227,
      "sm": 2228,
      "margin": 2229,
      "identif": 2230,
      "percentage": 2231,
      "reduce": 2232,
      "expos": 2233,
      "ten": 2234,
      "##enture": 2235,
      "calc": 2236,
      "charge": 2237,
      "uncertain": 2238,
      "##inal": 2239,
      "base": 2240,
      "mul": 2241,
      "must": 2242,
      "ge": 2243,
      "decreased": 2244,
      "capac": 2245,
      "principles": 2246,
      "utiliz": 2247,
      "beginning": 2248,
      "##urch": 2249,
      "##iss": 2250,
      "cover": 2251,
      "charges": 2252,
      "suppli": 2253,
      "tre": 2254,
      "except": 2255,
      "great": 2256,
      "special": 2257,
      "sw": 2258,
      "according": 2259,
      "##tim": 2260,
      "##abor": 2261,
      "without": 2262,
      "programs": 2263,
      "receive": 2264,
      "warrants": 2265,
      "dil": 2266,
      "##ood": 2267,
      "rati": 2268,
      "affected": 2269,
      "quality": 2270,
      "expenditures": 2271,
      "located": 2272,
      "previously": 2273,
      "suff": 2274,
      "##omes": 2275,
      "##ateral": 2276,
      "office": 2277,
      "liquidity": 2278,
      "levels": 2279,
      "recent": 2280,
      "substantially": 2281,
      "completed": 2282,
      "##ification": 2283,
      "att": 2284,
      "kn": 2285,
      "before": 2286,
      "subsequent": 2287,
      "##atives": 2288,
      "volum": 2289,
